Yangtze-Side/CourseDesign_SCM_Controller/Sources/inc/stc15w_def.h
#define IE2_ES2_MSK                     BIT0
#define UART2_EnableInt()               SET_REG_BIT(IE2, IE2_ES2_MSK)
#define UART2_DisableInt()              CLR_REG_BIT(IE2, IE2_ES2_MSK)

#define IE2_ES3_MSK                     BIT3
#define UART3_EnableInt()               SET_REG_BIT(IE2, IE2_ES3_MSK)
#define UART3_DisableInt()              CLR_REG_BIT(IE2, IE2_ES3_MSK)

#define IE2_ES4_MSK                     BIT4
#define UART4_EnableInt()               SET_REG_BIT(IE2, IE2_ES4_MSK)
#define UART4_DisableInt()              CLR_REG_BIT(IE2, IE2_ES4_MSK)

#define LVD_EnableInt()                 (ELVD = 1)
#define LVD_DisableInt()                (ELVD = 0)

#define ADC_EnableInt()                 (EADC = 1)
#define ADC_DisableInt()                (EADC = 0)

#define IE2_ESPI_MSK                    BIT1
#define SPI_EnableInt()                 SET_REG_BIT(IE2, IE2_ESPI_MSK)
#define SPI_DisableInt()                CLR_REG_BIT(IE2, IE2_ESPI_MSK)

#define CMPCR1_PIE_MSK                  BIT5
#define CMPCR1_NIE_MSK                  BIT4
#define CMP_EnablePosedgeInt()          SET_REG_BIT(CMPCR1, CMPCR1_PIE_MSK)
#define CMP_EnableNegedgeInt()          SET_REG_BIT(CMPCR1, CMPCR1_NIE_MSK)
#define CMP_EnableEdgeInt()             SET_REG_BIT(CMPCR1, (CMPCR1_PIE_MSK | CMPCR1_NIE_MSK))
#define CMP_DisableInt()                CLR_REG_BIT(CMPCR1, (CMPCR1_PIE_MSK | CMPCR1_NIE_MSK))

#define PWMFDCR_EFDI_MSK                BIT3
#define PWMFD_EnableInt()               SET_REG_BIT(PWMFDCR, PWMFDCR_EFDI_MSK)
#define PWMFD_DisableInt()              CLR_REG_BIT(PWMFDCR, PWMFDCR_EFDI_MSK)

#define PWMCR_ECBI_MSK                  BIT6
#define PWM_EnableCounterInt()          SET_REG_BIT(PWMCR, PWMCR_ECBI_MSK)
#define PWM_DisableCounterInt()         CLR_REG_BIT(PWMCR, PWMCR_ECBI_MSK)

#define PWMnCR_EPWMI_MSK                BIT2
#define PWMnCR_ET2I_MSK                 BIT1
#define PWMnCR_ET1I_MSK                 BIT0
#define PWM_EnableCnT1Int(n)            SET_REG_BIT(PWM##n##CR, (PWMnCR_EPWMI_MSK | PWMnCR_ET1I_MSK))
#define PWM_EnableCnT2Int(n)            SET_REG_BIT(PWM##n##CR, (PWMnCR_EPWMI_MSK | PWMnCR_ET2I_MSK))
#define PWM_EnableCnT1T2Int(n)          SET_REG_BIT(PWM##n##CR, (PWMnCR_EPWMI_MSK | PWMnCR_ET1I_MSK | PWMnCR_ET2I_MSK))
#define PWM_DisableCnInt(n)             CLR_REG_BIT(PWM##n##CR, PWMnCR_EPWMI_MSK)

#define PWM_EnableC2T1Int()             PWM_EnableCnT1Int(2)
#define PWM_EnableC3T1Int()             PWM_EnableCnT1Int(3)
#define PWM_EnableC4T1Int()             PWM_EnableCnT1Int(4)
#define PWM_EnableC5T1Int()             PWM_EnableCnT1Int(5)
#define PWM_EnableC6T1Int()             PWM_EnableCnT1Int(6)
#define PWM_EnableC7T1Int()             PWM_EnableCnT1Int(7)

#define PWM_EnableC2T2Int()             PWM_EnableCnT2Int(2)
#define PWM_EnableC3T2Int()             PWM_EnableCnT2Int(3)
#define PWM_EnableC4T2Int()             PWM_EnableCnT2Int(4)
#define PWM_EnableC5T2Int()             PWM_EnableCnT2Int(5)
#define PWM_EnableC6T2Int()             PWM_EnableCnT2Int(6)
#define PWM_EnableC7T2Int()             PWM_EnableCnT2Int(7)

#define PWM_EnableC2T1T2Int()           PWM_EnableCnT1T2Int(2)
#define PWM_EnableC3T1T2Int()           PWM_EnableCnT1T2Int(3)
#define PWM_EnableC4T1T2Int()           PWM_EnableCnT1T2Int(4)
#define PWM_EnableC5T1T2Int()           PWM_EnableCnT1T2Int(5)
#define PWM_EnableC6T1T2Int()           PWM_EnableCnT1T2Int(6)
#define PWM_EnableC7T1T2Int()           PWM_EnableCnT1T2Int(7)

#define PWM_DisableC2Int()              PWM_DisableCnInt(2)
#define PWM_DisableC3Int()              PWM_DisableCnInt(3)
#define PWM_DisableC4Int()              PWM_DisableCnInt(4)
#define PWM_DisableC5Int()              PWM_DisableCnInt(5)
#define PWM_DisableC6Int()              PWM_DisableCnInt(6)
#define PWM_DisableC7Int()              PWM_DisableCnInt(7)

#define CMOD_ECF_MSK                    BIT0
#define PCA_EnableCounterInt()          SET_REG_BIT(CMOD, CMOD_ECF_MSK)
#define PCA_DisableCounterInt()         CLR_REG_BIT(CMOD, CMOD_ECF_MSK)

#define CCAPM0_ECCF0_MSK                BIT0
#define CCAPM1_ECCF1_MSK                BIT0
#define PCA_EnableCCF0Int()             SET_REG_BIT(CCAPM0, CCAPM0_ECCF0_MSK)
#define PCA_EnableCCF1Int()             SET_REG_BIT(CCAPM1, CCAPM1_ECCF1_MSK)
#define PCA_DisableCCF0Int()            CLR_REG_BIT(CCAPM0, CCAPM0_ECCF0_MSK)
#define PCA_DisableCCF1Int()            CLR_REG_BIT(CCAPM1, CCAPM1_ECCF1_MSK)

#define INT0_FallingRisingInt()         (IT0 = 0)
#define INT0_FallingInt()               (IT0 = 1)

#define INT0_CheckFlag()                (IE0)
#define INT0_ClearFlag()                (IE0 = 0)

#define INT1_FallingRisingInt()         (IT1 = 0)
#define INT1_FallingInt()               (IT1 = 1)

#define INT1_CheckFlag()                (IE1)
#define INT1_ClearFlag()                (IE1 = 0)

#define TIMER0_CheckFlag()              (TF0)
#define TIMER0_ClearFlag()              (TF0 = 0)

#define TIMER1_CheckFlag()              (TF1)
#define TIMER1_ClearFlag()              (TF1 = 0)

#define UART1_CheckRxFlag()             (RI)
#define UART1_CheckTxFlag()             (TI)
#define UART1_ClearRxFlag()             (RI = 0)
#define UART1_ClearTxFlag()             (TI = 0)
#define UART1_SetRxFlag()               (RI = 1)
#define UART1_SetTxFlag()               (TI = 1)

#define S2CON_S2TI_MSK                  BIT1
#define S2CON_S2RI_MSK                  BIT0
#define UART2_CheckRxFlag()             READ_REG_BIT(S2CON, S2CON_S2RI_MSK)
#define UART2_CheckTxFlag()             READ_REG_BIT(S2CON, S2CON_S2TI_MSK)
#define UART2_ClearRxFlag()             CLR_REG_BIT(S2CON, S2CON_S2RI_MSK)
#define UART2_ClearTxFlag()             CLR_REG_BIT(S2CON, S2CON_S2TI_MSK)
#define UART2_SetRxFlag()               SET_REG_BIT(S2CON, S2CON_S2RI_MSK)
#define UART2_SetTxFlag()               SET_REG_BIT(S2CON, S2CON_S2TI_MSK)

#define S3CON_S3TI_MSK                  BIT1
#define S3CON_S3RI_MSK                  BIT0
#define UART3_CheckRxFlag()             READ_REG_BIT(S3CON, S3CON_S3RI_MSK)
#define UART3_CheckTxFlag()             READ_REG_BIT(S3CON, S3CON_S3TI_MSK)
#define UART3_ClearRxFlag()             CLR_REG_BIT(S3CON, S3CON_S3RI_MSK)
#define UART3_ClearTxFlag()             CLR_REG_BIT(S3CON, S3CON_S3TI_MSK)
#define UART3_SetRxFlag()               SET_REG_BIT(S3CON, S3CON_S3RI_MSK)
#define UART3_SetTxFlag()               SET_REG_BIT(S3CON, S3CON_S3TI_MSK)

#define S4CON_S4TI_MSK                  BIT1
#define S4CON_S4RI_MSK                  BIT0
#define UART4_CheckRxFlag()             READ_REG_BIT(S4CON, S4CON_S4RI_MSK)
#define UART4_CheckTxFlag()             READ_REG_BIT(S4CON, S4CON_S4TI_MSK)
#define UART4_ClearRxFlag()             CLR_REG_BIT(S4CON, S4CON_S4RI_MSK)
#define UART4_ClearTxFlag()             CLR_REG_BIT(S4CON, S4CON_S4TI_MSK)
#define UART4_SetRxFlag()               SET_REG_BIT(S4CON, S4CON_S4RI_MSK)
#define UART4_SetTxFlag()               SET_REG_BIT(S4CON, S4CON_S4TI_MSK)

#define PCON_LVDF_MSK                   BIT5
#define LVD_CheckFlag()                 READ_REG_BIT(PCON, PCON_LVDF_MSK)
#define LVD_ClearFlag()                 CLR_REG_BIT(PCON, PCON_LVDF_MSK)

#define ADCCONTR_ADCFLAG_MSK            BIT4
#define ADC_CheckFlag()                 READ_REG_BIT(ADC_CONTR, ADCCONTR_ADCFLAG_MSK)
#define ADC_ClearFlag()                 CLR_REG_BIT(ADC_CONTR, ADCCONTR_ADCFLAG_MSK)

