Yangtze-Side/CourseDesign_SCM_Controller/Sources/inc/stc15w_def.h
#define SPSTAT_SPIF_MSK                 BIT7
#define SPSTAT_WCOL_MSK                 BIT6
#define SPI_CheckFlag()                 READ_REG_BIT(SPSTAT, SPSTAT_SPIF_MSK)
#define SPI_ClearFlag()                 SET_REG_BIT(SPSTAT, SPSTAT_SPIF_MSK | SPSTAT_WCOL_MSK)

#define CMPCR1_CMPIF_MSK                BIT6
#define CMP_CheckFlag()                 READ_REG_BIT(CMPCR1, CMPCR1_CMPIF_MSK)
#define CMP_ClearFlag()                 CLR_REG_BIT(CMPCR1, CMPCR1_CMPIF_MSK)

#define PWMFDCR_FDIF_MSK                BIT0
#define PWMFD_CheckFlag()               READ_REG_BIT(PWMFDCR, PWMFDCR_FDIF_MSK)
#define PWMFD_ClearFlag()               CLR_REG_BIT(PWMFDCR, PWMFDCR_FDIF_MSK)

#define PWMIF_CBIF_MSK                  BIT6
#define PWM_CheckCounterFlag()          READ_REG_BIT(PWMIF, PWMIF_CBIF_MSK)
#define PWM_ClearCounterFlag()          CLR_REG_BIT(PWMIF, PWMIF_CBIF_MSK)

#define PWMIF_C2IF_MSK                  BIT0
#define PWMIF_C3IF_MSK                  BIT1
#define PWMIF_C4IF_MSK                  BIT2
#define PWMIF_C5IF_MSK                  BIT3
#define PWMIF_C6IF_MSK                  BIT4
#define PWMIF_C7IF_MSK                  BIT5
#define PWM_CheckC2Flag()               READ_REG_BIT(PWMIF, PWMIF_C2IF_MSK)
#define PWM_CheckC3Flag()               READ_REG_BIT(PWMIF, PWMIF_C3IF_MSK)
#define PWM_CheckC4Flag()               READ_REG_BIT(PWMIF, PWMIF_C4IF_MSK)
#define PWM_CheckC5Flag()               READ_REG_BIT(PWMIF, PWMIF_C5IF_MSK)
#define PWM_CheckC6Flag()               READ_REG_BIT(PWMIF, PWMIF_C6IF_MSK)
#define PWM_CheckC7Flag()               READ_REG_BIT(PWMIF, PWMIF_C7IF_MSK)
#define PWM_ClearC2Flag()               CLR_REG_BIT(PWMIF, PWMIF_C2IF_MSK)
#define PWM_ClearC3Flag()               CLR_REG_BIT(PWMIF, PWMIF_C3IF_MSK)
#define PWM_ClearC4Flag()               CLR_REG_BIT(PWMIF, PWMIF_C4IF_MSK)
#define PWM_ClearC5Flag()               CLR_REG_BIT(PWMIF, PWMIF_C5IF_MSK)
#define PWM_ClearC6Flag()               CLR_REG_BIT(PWMIF, PWMIF_C6IF_MSK)
#define PWM_ClearC7Flag()               CLR_REG_BIT(PWMIF, PWMIF_C7IF_MSK)

#define CCON_CF_MSK                     BIT7
#define PCA_CheckCounterFlag()          READ_REG_BIT(CCON, CCON_CF_MSK)
#define PCA_ClearCounterFlag()          CLR_REG_BIT(CCON, CCON_CF_MSK)

#define CCON_CCF0_MSK                   BIT0
#define CCON_CCF1_MSK                   BIT1
#define PCA_CheckCCF0Flag()             READ_REG_BIT(CCON, CCON_CCF0_MSK)
#define PCA_CheckCCF1Flag()             READ_REG_BIT(CCON, CCON_CCF1_MSK)
#define PCA_ClearCCF0Flag()             CLR_REG_BIT(CCON, CCON_CCF0_MSK)
#define PCA_ClearCCF1Flag()             CLR_REG_BIT(CCON, CCON_CCF1_MSK)

#define INT0_SetIntPriority(n)          PX0 = ((n) & 1)

#define INT1_SetIntPriority(n)          PX1 = ((n) & 1)

#define IP2_PX4_MSK                     BIT4
#define INT4_SetIntPriority(n)          MODIFY_REG(IP2, IP2_PX4_MSK, (((n) & 1) << 4))

#define TIMER0_SetIntPriority(n)        PT0 = ((n) & 1)

#define TIMER1_SetIntPriority(n)        PT1 = ((n) & 1)

#define UART1_SetIntPriority(n)         PS = ((n) & 1)

#define IP2_PS2_MSK                     BIT0
#define UART2_SetIntPriority(n)         MODIFY_REG(IP2, IP2_PS2_MSK, (((n) & 1) << 0))

#define LVD_SetIntPriority(n)           PLVD = ((n) & 1)

#define ADC_SetIntPriority(n)           PADC = ((n) & 1)

#define IP2_PSPI_MSK                    BIT1
#define SPI_SetIntPriority(n)           MODIFY_REG(IP2, IP2_PSPI_MSK, (((n) & 1) << 1))

#define IP2_PPWMFD_MSK                  BIT3
#define PWMFD_SetIntPriority(n)         MODIFY_REG(IP2, IP2_PPWMFD_MSK, (((n) & 1) << 3))

#define IP2_PPWM_MSK                    BIT2
#define PWM_SetIntPriority(n)           MODIFY_REG(IP2, IP2_PPWM_MSK, (((n) & 1) << 2))

#define PCA_SetIntPriority(n)           PPCA = ((n) & 1)

/////////////////////////////////////////////////

#define EAXFR_MSK                       BIT7
#define EnableAccessXFR()               SET_REG_BIT(P_SW2, EAXFR_MSK)

#define UART1_PS_MSK                    (BIT7 | BIT6)
#define UART1_SwitchP3031()             MODIFY_REG(P_SW1, UART1_PS_MSK, ((0) << 6))
#define UART1_SwitchP3637()             MODIFY_REG(P_SW1, UART1_PS_MSK, ((1) << 6))
#define UART1_SwitchP1617()             MODIFY_REG(P_SW1, UART1_PS_MSK, ((2) << 6))

#define UART2_PS_MSK                    (BIT0)
#define UART2_SwitchP1011()             CLR_REG_BIT(P_SW2, UART2_PS_MSK)
#define UART2_SwitchP4647()             SET_REG_BIT(P_SW2, UART2_PS_MSK)

#define UART3_PS_MSK                    (BIT1)
#define UART3_SwitchP0001()             CLR_REG_BIT(P_SW2, UART3_PS_MSK)
#define UART3_SwitchP5051()             SET_REG_BIT(P_SW2, UART3_PS_MSK)

#define UART4_PS_MSK                    (BIT2)
#define UART4_SwitchP0203()             CLR_REG_BIT(P_SW2, UART4_PS_MSK)
#define UART4_SwitchP5253()             SET_REG_BIT(P_SW2, UART4_PS_MSK)

#define SPI_PS_MSK                      (BIT3 | BIT2)
#define SPI_SwitchP1n()                 MODIFY_REG(P_SW1, SPI_PS_MSK, ((0) << 2))
#define SPI_SwitchP2n()                 MODIFY_REG(P_SW1, SPI_PS_MSK, ((1) << 2))
#define SPI_SwitchP4n()                 MODIFY_REG(P_SW1, SPI_PS_MSK, ((2) << 2))

#define CMPNS_MSK                       BIT2
#define CMPN_SwitchVREF()               CLR_REG_BIT(CMPCR1, CMPNS_MSK)
#define CMPN_SwitchP54()                SET_REG_BIT(CMPCR1, CMPNS_MSK)

#define CMPPS_MSK                       BIT3
#define CMPP_SwitchP55()                CLR_REG_BIT(CMPCR1, CMPPS_MSK)
#define CMPP_SwitchADCIN()              SET_REG_BIT(CMPCR1, CMPPS_MSK)

#define CMPO_SwitchP12()

#define MCLKO_PS_MSK                    (BIT3)
#define CLK_SYSCLKO_SwitchP54()         CLR_REG_BIT(CLK_DIV, MCLKO_PS_MSK)
#define CLK_SYSCLKO_SwitchP16()         SET_REG_BIT(CLK_DIV, MCLKO_PS_MSK)

#define PCA_PS_MSK                      (BIT5 | BIT4)
#define PCA_SwitchP1n()                 MODIFY_REG(P_SW1, PCA_PS_MSK, ((0) << 4))
#define PCA_SwitchP3n()                 MODIFY_REG(P_SW1, PCA_PS_MSK, ((1) << 4))
#define PCA_SwitchP2n()                 MODIFY_REG(P_SW1, PCA_PS_MSK, ((2) << 4))

#define PWM_C2PS_MSK                    BIT3
#define PWM_C3PS_MSK                    BIT3
#define PWM_C4PS_MSK                    BIT3
#define PWM_C5PS_MSK                    BIT3
#define PWM_C6PS_MSK                    BIT3
#define PWM_C7PS_MSK                    BIT3
#define PWM_C2_SwitchP37()              CLR_REG_BIT(PWM2CR, PWM_C2PS_MSK)
#define PWM_C2_SwitchP27()              SET_REG_BIT(PWM2CR, PWM_C2PS_MSK)
#define PWM_C3_SwitchP21()              CLR_REG_BIT(PWM3CR, PWM_C3PS_MSK)
#define PWM_C3_SwitchP45()              SET_REG_BIT(PWM3CR, PWM_C3PS_MSK)
#define PWM_C4_SwitchP22()              CLR_REG_BIT(PWM4CR, PWM_C4PS_MSK)
#define PWM_C4_SwitchP44()              SET_REG_BIT(PWM4CR, PWM_C4PS_MSK)
#define PWM_C5_SwitchP23()              CLR_REG_BIT(PWM5CR, PWM_C5PS_MSK)
#define PWM_C5_SwitchP42()              SET_REG_BIT(PWM5CR, PWM_C5PS_MSK)
#define PWM_C6_SwitchP16()              CLR_REG_BIT(PWM6CR, PWM_C6PS_MSK)
#define PWM_C6_SwitchP07()              SET_REG_BIT(PWM6CR, PWM_C6PS_MSK)
#define PWM_C7_SwitchP17()              CLR_REG_BIT(PWM7CR, PWM_C7PS_MSK)
#define PWM_C7_SwitchP06()              SET_REG_BIT(PWM7CR, PWM_C7PS_MSK)

/////////////////////////////////////////////////

#define MCLKODIV_MSK                    (BIT7 | BIT6)
#define MCLKODIV2_MSK                   BIT3
#define CLK_SYSCLKO_Divider(n)          MODIFY_REG(CLK_DIV, MCLKODIV_MSK, ((n) << 6)); \
										MODIFY_REG(INT_CLKO, MCLKODIV2_MSK, (((n) & 4) << 1))
#define CLK_SYSCLKO_Divider1()			CLK_SYSCLKO_Divider(1)
#define CLK_SYSCLKO_Divider2()			CLK_SYSCLKO_Divider(2)
#define CLK_SYSCLKO_Divider4()			CLK_SYSCLKO_Divider(3)
#define CLK_SYSCLKO_Divider16()			CLK_SYSCLKO_Divider(4)

/////////////////////////////////////////////////

#define WDTCONTR_FLAG_MSK               BIT7
#define WDTCONTR_EN_MSK                 BIT5
#define WDTCONTR_CLR_MSK                BIT4
#define WDTCONTR_IDL_MSK                BIT3
#define WDTCONTR_PS_MSK                 (BIT2 | BIT1 | BIT0)

#define WDT_Enable()                    SET_REG_BIT(WDT_CONTR, WDTCONTR_EN_MSK)
#define WDT_Clear()                     SET_REG_BIT(WDT_CONTR, WDTCONTR_CLR_MSK)
#define WDT_CheckWDTReset()             READ_REG_BIT(WDT_CONTR, WDTCONTR_FLAG_MSK)
#define WDT_IdlePause()                 CLR_REG_BIT(WDT_CONTR, WDTCONTR_IDL_MSK)
#define WDT_IdleContinue()              SET_REG_BIT(WDT_CONTR, WDTCONTR_IDL_MSK)

#define WDT_SetPrescale(n)              MODIFY_REG(WDT_CONTR, WDTCONTR_PS_MSK, ((n) << 0))
#define WDT_SetPrescale2()              WDT_SetPrescale(0)
#define WDT_SetPrescale4()              WDT_SetPrescale(1)
#define WDT_SetPrescale8()              WDT_SetPrescale(2)
#define WDT_SetPrescale16()             WDT_SetPrescale(3)
#define WDT_SetPrescale32()             WDT_SetPrescale(4)
#define WDT_SetPrescale64()             WDT_SetPrescale(5)
#define WDT_SetPrescale128()            WDT_SetPrescale(6)
#define WDT_SetPrescale256()            WDT_SetPrescale(7)

/////////////////////////////////////////////////

#define TIMER0_Run()                    (TR0 = 1)
#define TIMER0_Stop()                   (TR0 = 0)

