Yangtze-Side/CourseDesign_SCM_Controller/Sources/inc/stc15w_def.h
#define ADC_ReadResult()                MAKEWORD(ADC_RESL, ADC_RES)

#define ADCCONTR_ADCSTART_MSK           BIT3
#define ADC_Start()                     SET_REG_BIT(ADC_CONTR, ADCCONTR_ADCSTART_MSK)

#define ADCCONTR_ADCCHS_MSK             (BIT2 | BIT1 | BIT0)
#define ADC_ActiveChannel(n)            MODIFY_REG(ADC_CONTR, ADCCONTR_ADCCHS_MSK, ((n) << 0))

#define PWMCFG_CBTADC_MSK               BIT6
#define ADC_EnablePWMTrig()             SET_REG_BIT(PWMCFG, PWMCFG_CBTADC_MSK)

#define CLKDIV_ADRJ_MSK                 BIT5
#define ADC_ResultLeftAlign()           CLR_REG_BIT(CLK_DIV, CLKDIV_ADRJ_MSK)
#define ADC_ResultRightAlign()          SET_REG_BIT(CLK_DIV, CLKDIV_ADRJ_MSK)

#define ADCCONTR_SPEED_MSK              (BIT6 | BIT5)
#define ADC_SetClockDivider(n)          MODIFY_REG(ADC_CONTR, ADCCONTR_SPEED_MSK, ((n) << 5))
#define ADC_SetSpeedTo90Clocks()        ADC_SetClockDivider(3)
#define ADC_SetSpeedTo180Clocks()       ADC_SetClockDivider(2)
#define ADC_SetSpeedTo360Clocks()       ADC_SetClockDivider(1)
#define ADC_SetSpeedTo540Clocks()       ADC_SetClockDivider(0)

/////////////////////////////////////////////////

#define CCON_CR_MSK                     BIT6
#define PCA_Run()                       SET_REG_BIT(CCON, CCON_CR_MSK)
#define PCA_Stop()                      CLR_REG_BIT(CCON, CCON_CR_MSK)

#define CMOD_CIDL_MSK                   BIT7
#define PCA_IdlePause()                 SET_REG_BIT(CMOD, CMOD_CIDL_MSK)
#define PCA_IdleContinue()              CLR_REG_BIT(CMOD, CMOD_CIDL_MSK)

#define CMOD_CPS_MSK                    (BIT3 |BIT2 |BIT1)
#define PCA_SetClockSource(n)           MODIFY_REG(CMOD, CMOD_CPS_MSK, ((n) << 1))
#define PCA_CLK_SYSCLKD12()             PCA_SetClockSource(0)
#define PCA_CLK_SYSCLKD2()              PCA_SetClockSource(1)
#define PCA_CLK_TIMER0OV()              PCA_SetClockSource(2)
#define PCA_CLK_ECI()                   PCA_SetClockSource(3)
#define PCA_CLK_SYSCLK()                PCA_SetClockSource(4)
#define PCA_CLK_SYSCLKD4()              PCA_SetClockSource(5)
#define PCA_CLK_SYSCLKD6()              PCA_SetClockSource(6)
#define PCA_CLK_SYSCLKD8()              PCA_SetClockSource(7)

#define PCA_SetCounter(n)               (CH = HIBYTE(n), CL = LOBYTE(n))
#define PCA_InitCounter()               PCA_SetCounter(0)

#define PCA_SetCnReload(n, v)           CCAP##n##L = LOBYTE(v); \
                                        CCAP##n##H = LOBYTE(v)

#define PCA_SetCnMatch(n, v)            (CCAP##n##L = LOBYTE(v), CCAP##n##H = HIBYTE(v))

#define PCA_ReadCnCapture(n)            MAKEWORD(CCAP##n##L, CCAP##n##H)

#define CCAPMn_ECOM_MSK                 BIT6
#define CCAPMn_CCAPP_MSK                BIT5
#define CCAPMn_CCAPN_MSK                BIT4
#define CCAPMn_MAT_MSK                  BIT3
#define CCAPMn_TOG_MSK                  BIT2
#define CCAPMn_PWM_MSK                  BIT1
#define PCAPWMn_EBS_MSK                 (BIT7 | BIT6)

#define PCA_DisableCn(n)    			CCAPM##n = 0

#define PCA_SetCnAs6BitPWMMode(n)       CCAPM##n = (CCAPMn_ECOM_MSK | CCAPMn_PWM_MSK); \
                                        MODIFY_REG(PCA_PWM##n, PCAPWMn_EBS_MSK, ((2) << 6))
#define PCA_SetCnAs7BitPWMMode(n)       CCAPM##n = (CCAPMn_ECOM_MSK | CCAPMn_PWM_MSK); \
                                        MODIFY_REG(PCA_PWM##n, PCAPWMn_EBS_MSK, ((1) << 6))
#define PCA_SetCnAs8BitPWMMode(n)       CCAPM##n = (CCAPMn_ECOM_MSK | CCAPMn_PWM_MSK); \
                                        MODIFY_REG(PCA_PWM##n, PCAPWMn_EBS_MSK, ((0) << 6))

#define PCA_EnableCnCapturePWMPos(n)    MODIFY_REG(CCAPM##n, CCAPMn_CCAPP_MSK | CCAPMn_CCAPN_MSK, (CCAPMn_CCAPP_MSK))
#define PCA_EnableCnCapturePWMNeg(n)    MODIFY_REG(CCAPM##n, CCAPMn_CCAPP_MSK | CCAPMn_CCAPN_MSK, (CCAPMn_CCAPN_MSK))
#define PCA_EnableCnCapturePWMEdge(n)   CCAPM##n |= (CCAPMn_CCAPP_MSK | CCAPMn_CCAPN_MSK)

#define PCA_SetCnAsCapturePosMode(n)    CCAPM##n = (CCAPMn_CCAPP_MSK)
#define PCA_SetCnAsCaptureNegMode(n)    CCAPM##n = (CCAPMn_CCAPN_MSK)
#define PCA_SetCnAsCaptureEdgeMode(n)   CCAPM##n = (CCAPMn_CCAPP_MSK | CCAPMn_CCAPN_MSK)

#define PCA_SetCnAs16BitTimerMode(n)    CCAPM##n = (CCAPMn_ECOM_MSK | CCAPMn_MAT_MSK)

#define PCA_SetCnAsHighSpeedPulseMode(n) CCAPM##n = (CCAPMn_ECOM_MSK | CCAPMn_MAT_MSK | CCAPMn_TOG_MSK)

#define PCA_DisableC0()              	PCA_DisableCn(0)
#define PCA_DisableC1()              	PCA_DisableCn(1)

#define PCA_SetC0Reload(v)              PCA_SetCnReload(0, (v))
#define PCA_SetC1Reload(v)              PCA_SetCnReload(1, (v))

#define PCA_SetC0Match(v)               PCA_SetCnMatch(0, (v))
#define PCA_SetC1Match(v)               PCA_SetCnMatch(1, (v))

#define PCA_ReadC0Capture()             PCA_ReadCnCapture(0)
#define PCA_ReadC1Capture()             PCA_ReadCnCapture(1)

#define PCA_SetC0As6BitPWMMode()        PCA_SetCnAs6BitPWMMode(0)
#define PCA_SetC1As6BitPWMMode()        PCA_SetCnAs6BitPWMMode(1)

#define PCA_SetC0As7BitPWMMode()        PCA_SetCnAs7BitPWMMode(0)
#define PCA_SetC1As7BitPWMMode()        PCA_SetCnAs7BitPWMMode(1)

#define PCA_SetC0As8BitPWMMode()        PCA_SetCnAs8BitPWMMode(0)
#define PCA_SetC1As8BitPWMMode()        PCA_SetCnAs8BitPWMMode(1)

#define PCA_EnableC0CapturePWMPos()     PCA_EnableCnCapturePWMPos(0)
#define PCA_EnableC1CapturePWMPos()     PCA_EnableCnCapturePWMPos(1)

#define PCA_EnableC0CapturePWMNeg()     PCA_EnableCnCapturePWMNeg(0)
#define PCA_EnableC1CapturePWMNeg()     PCA_EnableCnCapturePWMNeg(1)

#define PCA_EnableC0CapturePWMEdge()    PCA_EnableCnCapturePWMEdge(0)
#define PCA_EnableC1CapturePWMEdge()    PCA_EnableCnCapturePWMEdge(1)

#define PCA_SetC0AsCapturePosMode()     PCA_SetCnAsCapturePosMode(0)
#define PCA_SetC1AsCapturePosMode()     PCA_SetCnAsCapturePosMode(1)

#define PCA_SetC0AsCaptureNegMode()     PCA_SetCnAsCaptureNegMode(0)
#define PCA_SetC1AsCaptureNegMode()     PCA_SetCnAsCaptureNegMode(1)

#define PCA_SetC0AsCaptureEdgeMode()    PCA_SetCnAsCaptureEdgeMode(0)
#define PCA_SetC1AsCaptureEdgeMode()    PCA_SetCnAsCaptureEdgeMode(1)

#define PCA_SetC0As16BitTimerMode()     PCA_SetCnAs16BitTimerMode(0)
#define PCA_SetC1As16BitTimerMode()     PCA_SetCnAs16BitTimerMode(1)

#define PCA_SetC0AsHighSpeedPulseMode() PCA_SetCnAsHighSpeedPulseMode(0)
#define PCA_SetC1AsHighSpeedPulseMode() PCA_SetCnAsHighSpeedPulseMode(1)

/////////////////////////////////////////////////

#define SPCTL_SPEN_MSK                  BIT6
#define SPI_Enable()                    SET_REG_BIT(SPCTL, SPCTL_SPEN_MSK)
#define SPI_Disable()                   CLR_REG_BIT(SPCTL, SPCTL_SPEN_MSK)

