Yangtze-Side/CourseDesign_SCM_Controller/Sources/inc/stc15w_def.h
#define SPCTL_DORD_MSK                  BIT5
#define SPI_DataLSB()                   SET_REG_BIT(SPCTL, SPCTL_DORD_MSK)
#define SPI_DataMSB()                   CLR_REG_BIT(SPCTL, SPCTL_DORD_MSK)

#define SPCTL_MSTR_MSK                  BIT4
#define SPI_MasterMode()                SET_REG_BIT(SPCTL, SPCTL_MSTR_MSK)
#define SPI_SlaveMode()                 CLR_REG_BIT(SPCTL, SPCTL_MSTR_MSK)

#define SPCTL_SSIG_MSK                  BIT7
#define SPI_IgnoreSS()                  SET_REG_BIT(SPCTL, SPCTL_SSIG_MSK)
#define SPI_UnignoreSS()                CLR_REG_BIT(SPCTL, SPCTL_SSIG_MSK)

#define SPCTL_CPOL_MSK                  BIT3
#define SPCTL_CPHA_MSK                  BIT2
#define SPIMODE                         (SPCTL_CPOL_MSK | SPCTL_CPHA_MSK)
#define SPI_SetMode0()                  MODIFY_REG(SPCTL, SPIMODE, ((0) << 2))
#define SPI_SetMode1()                  MODIFY_REG(SPCTL, SPIMODE, ((1) << 2))
#define SPI_SetMode2()                  MODIFY_REG(SPCTL, SPIMODE, ((2) << 2))
#define SPI_SetMode3()                  MODIFY_REG(SPCTL, SPIMODE, ((3) << 2))

#define SPCTL_SPR_MSK                   (BIT1 | BIT0)
#define SPI_SetClockDivider(n)          MODIFY_REG(SPCTL, SPCTL_SPR_MSK, ((n) << 0))
#define SPI_SetClockDivider4()          SPI_SetClockDivider(0)
#define SPI_SetClockDivider8()          SPI_SetClockDivider(1)
#define SPI_SetClockDivider16()         SPI_SetClockDivider(2)
#define SPI_SetClockDivider32()         SPI_SetClockDivider(3)

#define SPI_SendData(d)                 (SPDAT = (d))
#define SPI_ReadData()                  (SPDAT)

/////////////////////////////////////////////////

#define PWMFDCR_ENFD_MSK                BIT5
#define PWMFD_Enable()                  SET_REG_BIT(PWMFDCR, PWMFDCR_ENFD_MSK)
#define PWMFD_Disable()                 CLR_REG_BIT(PWMFDCR, PWMFDCR_ENFD_MSK)

#define PWMFDCR_FLTFLIO_MSK             BIT4
#define PWMFD_FaltFloatPort()           SET_REG_BIT(PWMFDCR, PWMFDCR_FLTFLIO_MSK)

#define PWMFDCR_FDCMP_MSK               BIT2
#define PWMFD_EnableCMPFalt()           SET_REG_BIT(PWMFDCR, PWMFDCR_FDCMP_MSK)
#define PWMFD_DisableCMPFalt()          CLR_REG_BIT(PWMFDCR, PWMFDCR_FDCMP_MSK)

#define PWMFDCR_FDIO_MSK                BIT1
#define PWMFD_EnablePortFalt()          SET_REG_BIT(PWMFDCR, PWMFDCR_FDIO_MSK)
#define PWMFD_DisablePortFalt()         CLR_REG_BIT(PWMFDCR, PWMFDCR_FDIO_MSK)

#define PWMCR_ENPWM_MAK                 BIT7
#define PWM_Enable()                    SET_REG_BIT(PWMCR, PWMCR_ENPWM_MAK)
#define PWM_Disable()                   CLR_REG_BIT(PWMCR, PWMCR_ENPWM_MAK)

#define PWMCR_ENC2O_MSK                 BIT0
#define PWMCR_ENC3O_MSK                 BIT1
#define PWMCR_ENC4O_MSK                 BIT2
#define PWMCR_ENC5O_MSK                 BIT3
#define PWMCR_ENC6O_MSK                 BIT4
#define PWMCR_ENC7O_MSK                 BIT5
#define PWM_EnableC2Output()            SET_REG_BIT(PWMCR, PWMCR_ENC2O_MSK)
#define PWM_EnableC3Output()            SET_REG_BIT(PWMCR, PWMCR_ENC3O_MSK)
#define PWM_EnableC4Output()            SET_REG_BIT(PWMCR, PWMCR_ENC4O_MSK)
#define PWM_EnableC5Output()            SET_REG_BIT(PWMCR, PWMCR_ENC5O_MSK)
#define PWM_EnableC6Output()            SET_REG_BIT(PWMCR, PWMCR_ENC6O_MSK)
#define PWM_EnableC7Output()            SET_REG_BIT(PWMCR, PWMCR_ENC7O_MSK)
#define PWM_DisableC2Output()           CLR_REG_BIT(PWMCR, PWMCR_ENC2O_MSK)
#define PWM_DisableC3Output()           CLR_REG_BIT(PWMCR, PWMCR_ENC3O_MSK)
#define PWM_DisableC4Output()           CLR_REG_BIT(PWMCR, PWMCR_ENC4O_MSK)
#define PWM_DisableC5Output()           CLR_REG_BIT(PWMCR, PWMCR_ENC5O_MSK)
#define PWM_DisableC6Output()           CLR_REG_BIT(PWMCR, PWMCR_ENC6O_MSK)
#define PWM_DisableC7Output()           CLR_REG_BIT(PWMCR, PWMCR_ENC7O_MSK)

#define PWMCFG_C2INI_MSK                BIT0
#define PWMCFG_C3INI_MSK                BIT1
#define PWMCFG_C4INI_MSK                BIT2
#define PWMCFG_C5INI_MSK                BIT3
#define PWMCFG_C6INI_MSK                BIT4
#define PWMCFG_C7INI_MSK                BIT5
#define PWM_InitialC2High()             SET_REG_BIT(PWMCFG, PWMCFG_C2INI_MSK)
#define PWM_InitialC3High()             SET_REG_BIT(PWMCFG, PWMCFG_C3INI_MSK)
#define PWM_InitialC4High()             SET_REG_BIT(PWMCFG, PWMCFG_C4INI_MSK)
#define PWM_InitialC5High()             SET_REG_BIT(PWMCFG, PWMCFG_C5INI_MSK)
#define PWM_InitialC6High()             SET_REG_BIT(PWMCFG, PWMCFG_C6INI_MSK)
#define PWM_InitialC7High()             SET_REG_BIT(PWMCFG, PWMCFG_C7INI_MSK)
#define PWM_InitialC2Low()              CLR_REG_BIT(PWMCFG, PWMCFG_C2INI_MSK)
#define PWM_InitialC3Low()              CLR_REG_BIT(PWMCFG, PWMCFG_C3INI_MSK)
#define PWM_InitialC4Low()              CLR_REG_BIT(PWMCFG, PWMCFG_C4INI_MSK)
#define PWM_InitialC5Low()              CLR_REG_BIT(PWMCFG, PWMCFG_C5INI_MSK)
#define PWM_InitialC6Low()              CLR_REG_BIT(PWMCFG, PWMCFG_C6INI_MSK)
#define PWM_InitialC7Low()              CLR_REG_BIT(PWMCFG, PWMCFG_C7INI_MSK)

#define PWMCFG_CBTADC_MSK               BIT6
#define PWM_EnableTriggerADC()          SET_REG_BIT(PWMCFG, PWMCFG_CBTADC_MSK)
#define PWM_DisableTriggerADC()         CLR_REG_BIT(PWMCFG, PWMCFG_CBTADC_MSK)

#define PWMCKS_SELT2_MSK                BIT4
#define PWM_CLK_SYSCLK()                CLR_REG_BIT(PWMCKS, PWMCKS_SELT2_MSK)
#define PWM_CLK_Timer2()                SET_REG_BIT(PWMCKS, PWMCKS_SELT2_MSK)

#define PWMCKS_SYSCLKPS_MSK             (BIT_LN)
#define PWM_SetClockDivider(n)          MODIFY_REG(PWMCKS, PWMCKS_SYSCLKPS_MSK, ((n) << 0))

#define PWM_SetCounter(n)               (PWMCH = HIBYTE(n), PWMCL = LOBYTE(n))
#define PWM_SetC2T1Point(n)             (PWM2T1H = HIBYTE(n), PWM2T1L = LOBYTE(n))
#define PWM_SetC2T2Point(n)             (PWM2T2H = HIBYTE(n), PWM2T2L = LOBYTE(n))
#define PWM_SetC3T1Point(n)             (PWM3T1H = HIBYTE(n), PWM3T1L = LOBYTE(n))
#define PWM_SetC3T2Point(n)             (PWM3T2H = HIBYTE(n), PWM3T2L = LOBYTE(n))
#define PWM_SetC4T1Point(n)             (PWM4T1H = HIBYTE(n), PWM4T1L = LOBYTE(n))
#define PWM_SetC4T2Point(n)             (PWM4T2H = HIBYTE(n), PWM4T2L = LOBYTE(n))
#define PWM_SetC5T1Point(n)             (PWM5T1H = HIBYTE(n), PWM5T1L = LOBYTE(n))
#define PWM_SetC5T2Point(n)             (PWM5T2H = HIBYTE(n), PWM5T2L = LOBYTE(n))
#define PWM_SetC6T1Point(n)             (PWM6T1H = HIBYTE(n), PWM6T1L = LOBYTE(n))
#define PWM_SetC6T2Point(n)             (PWM6T2H = HIBYTE(n), PWM6T2L = LOBYTE(n))
#define PWM_SetC7T1Point(n)             (PWM7T1H = HIBYTE(n), PWM7T1L = LOBYTE(n))
#define PWM_SetC7T2Point(n)             (PWM7T2H = HIBYTE(n), PWM7T2L = LOBYTE(n))

/////////////////////////////////////////////////
//Interrupt Vector
/////////////////////////////////////////////////

#define     INT0_VECTOR             0       //0003H
#define     TMR0_VECTOR             1       //000BH
#define     INT1_VECTOR             2       //0013H
#define     TMR1_VECTOR             3       //001BH
#define     UART1_VECTOR            4       //0023H
#define     ADC_VECTOR              5       //002BH
#define     LVD_VECTOR              6       //0033H
#define     PCA_VECTOR              7       //003BH
#define     UART2_VECTOR            8       //0043H
#define     SPI_VECTOR              9       //004BH
#define     INT2_VECTOR             10      //0053H
#define     INT3_VECTOR             11      //005BH
#define     TMR2_VECTOR             12      //0063H
#define     USER_VECTOR             13      //006BH
#define     INT4_VECTOR             16      //0083H
#define     UART3_VECTOR            17      //008BH
#define     UART4_VECTOR            18      //0093H
#define     TMR3_VECTOR             19      //009BH
#define     TMR4_VECTOR             20      //00A3H
#define     CMP_VECTOR              21      //00ABH
#define     PWM_VECTOR              22      //00B3H
#define     PWMFD_VECTOR            23      //00BBH

/////////////////////////////////////////////////

#define NOP1()  _nop_()
#define NOP2()  NOP1(),NOP1()
#define NOP3()  NOP2(),NOP1()
#define NOP4()  NOP3(),NOP1()
#define NOP5()  NOP4(),NOP1()
#define NOP6()  NOP5(),NOP1()
#define NOP7()  NOP6(),NOP1()
#define NOP8()  NOP7(),NOP1()
#define NOP9()  NOP8(),NOP1()
#define NOP10() NOP9(),NOP1()
#define NOP11() NOP10(),NOP1()
#define NOP12() NOP11(),NOP1()
#define NOP13() NOP12(),NOP1()
#define NOP14() NOP13(),NOP1()
#define NOP15() NOP14(),NOP1()
#define NOP16() NOP15(),NOP1()
#define NOP17() NOP16(),NOP1()
#define NOP18() NOP17(),NOP1()
#define NOP19() NOP18(),NOP1()
#define NOP20() NOP19(),NOP1()
#define NOP21() NOP20(),NOP1()
#define NOP22() NOP21(),NOP1()
#define NOP23() NOP22(),NOP1()
#define NOP24() NOP23(),NOP1()
#define NOP25() NOP24(),NOP1()
#define NOP26() NOP25(),NOP1()
#define NOP27() NOP26(),NOP1()
#define NOP28() NOP27(),NOP1()
#define NOP29() NOP28(),NOP1()
#define NOP30() NOP29(),NOP1()
#define NOP31() NOP30(),NOP1()
#define NOP32() NOP31(),NOP1()
#define NOP33() NOP32(),NOP1()
#define NOP34() NOP33(),NOP1()
#define NOP35() NOP34(),NOP1()
#define NOP36() NOP35(),NOP1()
#define NOP37() NOP36(),NOP1()
#define NOP38() NOP37(),NOP1()
#define NOP39() NOP38(),NOP1()
#define NOP40() NOP39(),NOP1()
#define NOP(N)  NOP##N()

/////////////////////////////////////////////////


#endif

